<!-- dflook/terraform-github-actions {"workspace":"variables-renderer-2","backend":"e469a6a3d921d6f2dd778e10c99035f8f13c5bc9f9f66336409f9f0e908fc41c","backend_type":"remote","plan_job_ref":"Job Test Terraform cloud #102 at https://github.com/dflook/terraform-github-actions/actions/runs/3526569817","plan_hash":"6f079a4462ff63e63e5cb3f0d4bc55bead6499db849a7b576214bda4114ea503","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __variables-renderer-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`<details><summary>With variables</summary>

```hcl
from_variables = "from_variables"

```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test Terraform cloud #102](https://github.com/dflook/terraform-github-actions/actions/runs/3526569817)